app/views/tapes/show.html.erb

<ul>
<% @tape.genres.each do |genre| %>
---
SELECT "genres".* FROM "genres" INNER JOIN "tape_genres" ON "genres"."id" = "tape_genres"."genre_id" WHERE "tape_genres"."tape_id" = ?  [["tape_id", 2]]

<ul>
<% @tape.actors.each do |actor| %>
---
SELECT "actors".* FROM "actors" INNER JOIN "tape_actors" ON "actors"."id" = "tape_actors"."actor_id" WHERE "tape_actors"."tape_id" = ?  [["tape_id", 2]]