app/views/clients/show.html.erb

<ul>
<% @client.genres.each do |genre| %>
---
SELECT "genres".* FROM "genres" INNER JOIN "client_genres" ON "genres"."id" = "client_genres"."genre_id" WHERE "client_genres"."client_id" = ?  [["client_id", 1]]

<ul>
<% @client.directors.each do |director| %>
---
SELECT "directors".* FROM "directors" INNER JOIN "client_directors" ON "directors"."id" = "client_directors"."director_id" WHERE "client_directors"."client_id" = ?  [["client_id", 1]]

<ul>
<% @client.actors.each do |actor| %>
---
SELECT "actors".* FROM "actors" INNER JOIN "client_actors" ON "actors"."id" = "client_actors"."actor_id" WHERE "client_actors"."client_id" = ?  [["client_id", 1]]