app/views/renteds/_form.html.erb

      <%= f.input :client, :as => :select %>
      <%= f.input :tape, :as => :select, :collection => Tape.where(available: true) %>
---
SELECT "tapes".* FROM "tapes" WHERE "tapes"."available" = ?  [["available", 1]]