app/controllers/actors_controller.rb

  def create
    @actor = Actor.new(actor_params)

    respond_to do |format|
      if @actor.save
---
INSERT INTO "actors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Samuel L. Jackson"], ["created_at", "2020-11-04 15:59:22.717306"], ["updated_at", "2020-11-04 15:59:22.717306"]]

    def set_actor
      @actor = Actor.find(params[:id])
---
SELECT "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]