app/controllers/clients_controller.rb

  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("code", "name", "address", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["code", "c2d66a47ea98d246c945"], ["name", "test"], ["address", "test"], ["phone", "test"], ["created_at", "2020-11-04 15:46:19.986376"], ["updated_at", "2020-11-04 15:46:19.986376"]]