app/controllers/directors_controller.rb

INSERT INTO "directors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Quentin Tarantino"], ["created_at", "2020-11-04 16:00:37.140145"], ["updated_at", "2020-11-04 16:00:37.140145"]]
---
  def create
    @director = Director.new(director_params)

    respond_to do |format|
      if @director.save

SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_director
      @director = Director.find(params[:id])