app/controllers/renteds_controller.rb

  def index
    @renteds = Rented.all
---
SELECT "renteds".* FROM "renteds"

  def create
    @rented = Rented.new(rented_params)

    respond_to do |format|
      if @rented.save
---
INSERT INTO "renteds" ("tape_id", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tape_id", 1], ["client_id", 1], ["created_at", "2020-11-04 17:54:06.494062"], ["updated_at", "2020-11-04 17:54:06.494062"]]

  def destroy
    @rented.destroy
---
DELETE FROM "renteds" WHERE "renteds"."id" = ?  [["id", 2]]

    def set_rented
      @rented = Rented.find(params[:id])
---
SELECT "renteds".* FROM "renteds" WHERE "renteds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]