app/controllers/returneds_controller.rb

  def index
    @returneds = Returned.all
---
SELECT "returneds".* FROM "returneds"

  def create
    @returned = Returned.new(returned_params)

    respond_to do |format|
      if @returned.save
---
INSERT INTO "returneds" ("tape_id", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tape_id", 1], ["client_id", 1], ["created_at", "2020-11-04 18:28:51.223920"], ["updated_at", "2020-11-04 18:28:51.223920"]]

    def set_returned
      @returned = Returned.find(params[:id])
---
SELECT "returneds".* FROM "returneds" WHERE "returneds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]