app/controllers/tapes_controller.rb

  def index
    @tapes = Tape.all
---
SELECT "tapes".* FROM "tapes"

  def create
    @tape = Tape.new(tape_params)

    respond_to do |format|
      if @tape.save
---
INSERT INTO "tapes" ("name", "code", "director_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Pulp Fiction"], ["code", "8c39b314293323c36792"], ["director_id", 1], ["created_at", "2020-11-04 17:52:51.005183"], ["updated_at", "2020-11-04 17:52:51.005183"]]

  def destroy
    @tape.destroy
---
DELETE FROM "tapes" WHERE "tapes"."id" = ?  [["id", 1]]

    def set_tape
      @tape = Tape.find(params[:id])
---
SELECT "tapes".* FROM "tapes" WHERE "tapes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]