app/controllers/waitlists_controller.rb

SELECT "waitlists".* FROM "waitlists"
---
  def index
    @waitlists = Waitlist.all

INSERT INTO "waitlists" ("tape_id", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tape_id", 1], ["client_id", 1], ["created_at", "2020-11-04 18:08:26.312213"], ["updated_at", "2020-11-04 18:08:26.312213"]]
---
  def create
    @waitlist = Waitlist.new(waitlist_params)

    respond_to do |format|
      if @waitlist.save

SELECT "waitlists".* FROM "waitlists" WHERE "waitlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_waitlist
      @waitlist = Waitlist.find(params[:id])