app/models/rented.rb

SELECT "tapes".* FROM "tapes" WHERE "tapes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tapes" SET "available" = ?, "updated_at" = ? WHERE "tapes"."id" = ?  [["available", 0], ["updated_at", "2020-11-04 18:22:44.298234"], ["id", 1]]
---
  def handle_rent
    tape = Tape.find(self.tape_id)
    tape.available = false
    tape.save()