app/models/returned.rb

  def handle_return
    tape = Tape.find(self.tape_id)
    tape.available = true
    tape.save()
---
SELECT "tapes".* FROM "tapes" WHERE "tapes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tapes" SET "available" = ?, "updated_at" = ? WHERE "tapes"."id" = ?  [["available", 1], ["updated_at", "2020-11-04 18:40:12.379255"], ["id", 1]]

  def notify
    @waitlist = Waitlist.where(tape_id: self.tape_id).first
    if @waitlist
      WaitlistMailer.with(client: @waitlist.client, tape: @waitlist.tape).notify.deliver_now
    end
    @waitlist.destroy
---
SELECT "waitlists".* FROM "waitlists" WHERE "waitlists"."tape_id" = ? ORDER BY "waitlists"."id" ASC LIMIT ?  [["tape_id", 1], ["LIMIT", 1]]
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tapes".* FROM "tapes" WHERE "tapes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "waitlists" WHERE "waitlists"."id" = ?  [["id", 1]]